import java.util.Scanner;

/*Перейдіть до класу Average і напишіть програму, яка зчитує послідовність цілих
 значень зі стандартного введення та знаходить середнє значення.
Подробиці:
Ви повинні зчитувати значення послідовності, доки наступне не стане 0.
Нульове значення означає кінець вхідної послідовності та не є її частиною.
Послідовність гарантовано містить хоча б одне значення.
Середнє значення також є цілим числом. Використовуйте цілі операції.
*/
public class Average {

    public static void main(String[] args) {
        Scanner scan = new Scanner(System.in);
        int i = 0;
        int sum = 0;
        while (true){
            int a = scan.nextInt();
            if (a == 0){
                break;
            }
            sum +=a;
            i++;
        }
        System.out.println(sum/i);
    }
}
